{
  "backend/main.mo": "Main actor defining all types (WorkerProfile, EmployerProfile, JobPosting, AttendanceRecord, PaymentRecord, etc.) and business logic for worker/employer management, job matching, attendance tracking, payments, ratings, analytics, favorites, templates, availability, and notifications with authorization mixin and migration support.",
  "backend/migration.mo": "Migration module that extends the actor state by adding a verifiedWorkers map with badge levels (bronze/silver/gold) based on completed job counts, creating VerifiedWorker records from existing WorkerProfile data during upgrade.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including worker verification badges, employer favorites management, job templates, worker availability calendar, and notifications with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including registration flows, dashboards, analytics, subscription management, bulk upload, QR codes, availability calendar, notifications, and wallet functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including landing, role selection, worker/employer registration and dashboards, job management, attendance, analytics, subscriptions, bulk upload, favorites, templates, availability, and notifications.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Displays a weekly availability calendar showing which days a worker is available, with optional edit mode to toggle availability per day.",
  "frontend/src/components/AvailabilityIndicator.tsx": "Shows a collapsible availability summary with percentage-based status (limited/partial/mostly available) and expandable full calendar view.",
  "frontend/src/components/ExperienceLevelBadge.tsx": "Renders a styled badge displaying worker experience level (novice/intermediate/expert) with corresponding color scheme.",
  "frontend/src/components/FavoriteToggle.tsx": "Heart icon button that allows users to add/remove workers from favorites with optimistic UI updates and toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing navigation header and footer with social links, quick navigation, and branding across all pages.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar with role-based menu items (worker/employer/admin), authentication controls, and notification bell integration.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon button displaying unread notification count badge that navigates to notifications page when clicked.",
  "frontend/src/components/NotificationList.tsx": "Displays a list of job reminder notifications with icons indicating status (confirmed/cancelled/reminder) and optional mark-as-read functionality.",
  "frontend/src/components/ReliabilityScoreBadge.tsx": "Shows worker reliability score out of 5.0 with color-coded badge (green/yellow/red) and descriptive label based on score range.",
  "frontend/src/components/SkillsMultiSelect.tsx": "Multi-select checkbox grid for choosing worker skills from predefined list (masonry, plumbing, electrician, etc.).",
  "frontend/src/components/UserRoleSelector.tsx": "Component for new users to select their role (worker or employer) and enter their name, then navigates to the appropriate registration page after saving the profile.",
  "frontend/src/components/VerificationBadge.tsx": "Displays a verification badge (bronze, silver, or gold) based on completed jobs count with a tooltip showing badge level and job count.",
  "frontend/src/components/WorkerQRCode.tsx": "Generates and displays a QR code for a worker ID using the qrcode.js library loaded from CDN.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient with delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, worker/employer profiles, job postings, matches, payments, and system metrics with proper cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page displaying system metrics including worker/employer counts, job fill rates, revenue data, and subscription tier distribution with charts.",
  "frontend/src/pages/AttendanceScanner.tsx": "Provides a QR code scanner interface for employers to check workers in/out of jobs. Uses camera to scan worker QR codes, displays recent scans, and submits attendance records via mutations.",
  "frontend/src/pages/BulkJobUpload.tsx": "Allows employers to bulk upload job postings via CSV file. Parses CSV data, validates job fields, provides a downloadable template, and displays validation results before batch creation.",
  "frontend/src/pages/CreateJobPosting.tsx": "Form page for employers to create individual job postings with skills, wage, duration, location, and worker count. Supports saving/loading job templates for reuse.",
  "frontend/src/pages/EmployerAnalytics.tsx": "Displays workforce analytics dashboard with charts showing skill reliability, completion trends, time-to-fill metrics, and top performer statistics. Uses recharts for data visualization.",
  "frontend/src/pages/EmployerDashboard.tsx": "Main employer dashboard showing key metrics (total jobs, active jobs, workers, completion rate) and recent activity. Provides overview cards with icons and statistics.",
  "frontend/src/pages/EmployerFavorites.tsx": "Displays an employer's list of favorited workers with cards showing worker profiles, verification badges, reliability scores, and completed jobs. Includes empty state with navigation to browse job candidates.",
  "frontend/src/pages/EmployerJobList.tsx": "Shows all job postings created by an employer with status badges, required skills, location, wage, and worker count. Provides buttons to create new jobs or bulk upload, with empty state for first-time users.",
  "frontend/src/pages/EmployerProfile.tsx": "Displays employer company profile information including company name, contact person, mobile number, company type, and coordinates. Redirects to registration if no profile exists.",
  "frontend/src/pages/EmployerRegistration.tsx": "Form for employers to register their company profile with fields for company name, contact person, mobile number, company type, and geolocation coordinates. Includes browser geolocation feature to auto-fill coordinates.",
  "frontend/src/pages/JobCandidates.tsx": "Shows matched worker candidates for a specific job posting with match scores, verification badges, availability indicators, and ability to assign workers to the job. Displays job details and assignment progress.",
  "frontend/src/pages/JobDiscovery.tsx": "Displays available job postings for workers, showing job details like wage, duration, positions, and required skills with filtering for incomplete jobs that still need workers.",
  "frontend/src/pages/JobTemplates.tsx": "Shows saved job templates for employers to reuse when creating similar job postings, with options to create new jobs from templates or start fresh.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page with hero section and platform features, handles authentication flow and redirects users to appropriate dashboards based on their role (worker/employer).",
  "frontend/src/pages/SubscriptionTiers.tsx": "Displays subscription tier options (Basic, Professional, Enterprise) for employers with feature comparisons, pricing, and current subscription status in simulation mode.",
  "frontend/src/pages/WorkerAvailability.tsx": "Worker availability management page that displays a calendar interface for workers to set their weekly availability pattern. Allows toggling day availability and saving changes with toast notifications.",
  "frontend/src/pages/WorkerNotifications.tsx": "Notifications dashboard for workers displaying job reminders and confirmations in tabbed views (all, unread, reminders, confirmations). Includes functionality to mark notifications as read and refresh the list.",
  "frontend/src/pages/WorkerProfile.tsx": "Worker profile display page showing personal information, statistics (reliability score, rating, completed jobs), skills, and a QR code. Includes verification badge display for verified workers.",
  "frontend/src/pages/WorkerRegistration.tsx": "Worker registration form for creating a new worker profile with fields for name, mobile number, skills, wage range, and geolocation. Includes geolocation auto-detection and converts skills to SkillWithExperience format.",
  "frontend/src/pages/WorkerWallet.tsx": "Worker wallet page displaying payment history, total earnings, and pending payments with CSV export functionality. Shows simulated payment data with status badges and payment method labels.",
  "frontend/src/pages/WorkHistory.tsx": "Shows worker's attendance records and analytics including total days worked, on-time arrival percentage, early departures, and job completion metrics with calendar heatmap visualization.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including HSL-based color system, spacing scale, typography settings, accordion animations, and plugins for animations and typography.",
  "project_state.json": "Project state document for IEE (International Employment Ecosystem), a web-based workforce platform connecting workers with employers, detailing architecture, existing features, known limitations (no mobile app, external integrations, or payment processing), and required UI assets."
}