{
  "backend/main.mo": "Main Motoko actor defining all data types (WorkerProfile, EmployerProfile, JobPosting, etc.), state management with Maps, and public functions for user profiles, worker/employer registration, job posting, matching, attendance, payments, and ratings with role-based access control.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including worker/employer authentication, QR code generation, job posting system, job discovery, and their associated files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components and pages describing their purpose, including registration forms, dashboards, navigation, QR code display, and role selection with implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the React application.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for landing page, role selection, worker/employer registration and profiles, job management, attendance scanning, work history, and wallet functionality.",
  "frontend/src/components/ExperienceLevelBadge.tsx": "Reusable badge component displaying worker experience level (novice, intermediate, expert) with color-coded styling, icons, and year ranges.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component with Navigation header, main content area, and footer containing platform info, quick links, social media icons, and Caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Main navigation component with responsive menu, authentication controls, and role-based navigation links for workers (jobs, profile, history, wallet) and employers (dashboard, jobs, workers, wallet). Includes mobile menu toggle and admin panel access.",
  "frontend/src/components/ReliabilityScoreBadge.tsx": "Displays a worker's reliability score (0-5) with color-coded badge (green/yellow/red) and label (Excellent/Good/Needs Improvement) based on score thresholds.",
  "frontend/src/components/SkillsMultiSelect.tsx": "Multi-select checkbox component for choosing construction skills (masonry, plumbing, electrician, carpentry, painting, roofing, flooring, tiling, welding, general labor) with grid layout.",
  "frontend/src/components/UserRoleSelector.tsx": "Onboarding component for new users to enter their name and select role (worker or employer), then navigates to appropriate registration flow based on selection.",
  "frontend/src/components/WorkerQRCode.tsx": "Generates and displays a QR code for a worker ID using the qrcode.js library loaded from CDN, with the worker ID displayed below the code.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, worker profiles, employer profiles, job postings, candidate matching, payments, and system metrics with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for light/dark theme colors, plus base styles for typography and accessibility (minimum touch target sizes).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AttendanceScanner.tsx": "QR code scanner page for employers to check workers in/out of jobs, featuring live video scanning, job selection, and a dialog to confirm attendance actions.",
  "frontend/src/pages/CreateJobPosting.tsx": "Form page for employers to create new job postings with fields for skills, wage, duration, location (with geolocation support), shift timing, worker count, and job description.",
  "frontend/src/pages/EmployerDashboard.tsx": "Dashboard overview for employers showing key metrics (total jobs, active jobs, total workers, completion rate) and recent activity from their job postings.",
  "frontend/src/pages/EmployerJobList.tsx": "Lists all job postings created by the employer with details like skills, wage, duration, worker count, and location, plus navigation to create new jobs or view job details.",
  "frontend/src/pages/EmployerProfile.tsx": "Displays employer company profile information including company name, type, contact person, mobile number, and coordinates with option to create profile if none exists.",
  "frontend/src/pages/EmployerRegistration.tsx": "Employer registration form that collects company details (name, contact, type, location) and saves an employer profile. Uses geolocation API for coordinates and redirects to employer dashboard on success.",
  "frontend/src/pages/JobDiscovery.tsx": "Displays a list of available job postings filtered by completion status and worker capacity. Shows job details including skills, wage, duration, positions, and shift timing in card format.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section and feature cards. Handles Internet Identity login and redirects authenticated users to role-specific dashboards (worker/employer) or role selection.",
  "frontend/src/pages/WorkerProfile.tsx": "Worker profile view showing personal details, skills, experience level, wage range, and availability toggle. Includes QR code component and reliability/experience badges.",
  "frontend/src/pages/WorkerRegistration.tsx": "Worker registration form collecting mobile number, skills (multi-select), experience level, wage range, and location coordinates. Creates worker profile and redirects to profile page on success.",
  "frontend/src/pages/WorkerWallet.tsx": "Worker wallet page displaying total earnings, pending payments, and payment history with job details and payment status badges.",
  "frontend/src/pages/WorkHistory.tsx": "Displays worker's attendance records and job completion summary including total jobs, attendance count, and rating. Shows check-in/check-out times for each work record.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, typography, container queries, animations, and design tokens for the UI component system.",
  "project_state.json": "Project metadata defining IEE workforce platform architecture, features, known limitations (no mobile app, external integrations, or payment processing), and image requirements."
}