{
  "backend/main.mo": "Main Motoko actor defining all data types (WorkerProfile, EmployerProfile, JobPosting, AttendanceRecord, PaymentRecord, etc.) and including MixinAuthorization for access control with comprehensive CRUD operations for workers, employers, jobs, attendance, payments, ratings, and system metrics.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (job browsing, Internet Identity authentication, landing page, role selection, dashboards, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components and pages, describing their functionality including registration forms, dashboards, analytics, QR codes, wallet, work history, and navigation components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the main React application from /src/main.tsx.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration, ProtectedRoute wrapper for authentication guards, and route definitions for all worker/employer pages (dashboards, registration, profiles, jobs, analytics, admin) with automatic role-based navigation.",
  "frontend/src/components/AvailabilityCalendar.tsx": "Reusable calendar component displaying weekly worker availability (Monday-Sunday) with visual indicators for available/unavailable days, optional time ranges, and editable mode allowing click-to-toggle availability.",
  "frontend/src/components/AvailabilityIndicator.tsx": "Displays a worker's availability status with a collapsible calendar view, showing availability percentage with color-coded status (green/yellow/red) and expandable detailed calendar.",
  "frontend/src/components/ExperienceLevelBadge.tsx": "Renders a styled badge displaying worker experience level (novice/intermediate/expert) with corresponding color schemes and year ranges.",
  "frontend/src/components/FavoriteToggle.tsx": "Heart icon button that toggles a worker's favorite status, using mutations to add/remove favorites with toast notifications.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing navigation header, content area, and footer with social links and branding including caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Top navigation bar with authentication, role-based menu items (worker/employer/admin), mobile menu support, and notification bell integration.",
  "frontend/src/components/NotificationBell.tsx": "Bell icon button with unread notification count badge that navigates to worker notifications page.",
  "frontend/src/components/NotificationList.tsx": "Displays a list of job reminder notifications with icons indicating status (cancelled/confirmed/reminder) and optional mark-as-read functionality.",
  "frontend/src/components/ReliabilityScoreBadge.tsx": "Shows a worker's reliability score out of 5.0 with color-coded badge (green/yellow/red) and text label (Excellent/Good/Needs Improvement).",
  "frontend/src/components/SkillsMultiSelect.tsx": "Multi-select checkbox grid for choosing worker skills from predefined options (masonry, plumbing, electrician, etc.).",
  "frontend/src/components/UserRoleSelector.tsx": "Onboarding component for new users to enter their name and select role (worker or employer) before registration, with visual role cards.",
  "frontend/src/components/VerificationBadge.tsx": "React component that displays a verification badge (bronze, silver, or gold) based on completed jobs count, with tooltip showing badge level and job count.",
  "frontend/src/components/WorkerQRCode.tsx": "React component that generates and displays a QR code for a worker ID using the qrcode library loaded from CDN.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, worker/employer management, job postings, attendance, payments, and system metrics.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using OKLCH color space, defining colors for UI components and base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying system-wide metrics with charts (workers, employers, job fill rate, revenue) using Recharts, with admin access control.",
  "frontend/src/pages/AttendanceScanner.tsx": "QR code scanner page for recording worker check-in/check-out attendance using device camera, with action toggle and real-time scanning feedback.",
  "frontend/src/pages/BulkJobUpload.tsx": "Employer page for bulk uploading job postings via CSV file. Parses CSV rows into job objects, validates them, displays preview with error indicators, and submits valid jobs to the backend.",
  "frontend/src/pages/CreateJobPosting.tsx": "Form page for employers to create individual job postings with skills, wage, duration, location, and worker count. Includes functionality to save/load job templates and auto-detect geolocation.",
  "frontend/src/pages/EmployerAnalytics.tsx": "Analytics dashboard for employers showing workforce metrics including completion rates, skill-based reliability scores, time-to-fill statistics, and top performer rankings with charts and visualizations.",
  "frontend/src/pages/EmployerDashboard.tsx": "Main employer dashboard displaying overview metrics (total jobs, active jobs, total workers, completion rate) and recent activity feed from job postings.",
  "frontend/src/pages/EmployerFavorites.tsx": "Page displaying employer's favorited workers with cards showing worker profiles, verification badges, reliability scores, and quick access to contact or view details.",
  "frontend/src/pages/EmployerJobList.tsx": "Displays a list of job postings created by the employer with options to create new jobs or bulk upload. Shows job details including skills, wage, duration, location, and assigned workers count with navigation to candidate and detail views.",
  "frontend/src/pages/EmployerProfile.tsx": "Displays the employer's company profile information including company name, contact person, mobile number, company type, and coordinates. Redirects to registration if no profile exists.",
  "frontend/src/pages/EmployerRegistration.tsx": "Form for employers to register their company profile with fields for company name, contact person, mobile number, company type, and location coordinates. Includes geolocation support to auto-fill coordinates.",
  "frontend/src/pages/JobCandidates.tsx": "Shows matched worker candidates for a specific job posting with match scores, verification status, and availability. Allows employers to assign workers to jobs and toggle favorites.",
  "frontend/src/pages/JobDiscovery.tsx": "Displays all available job postings for workers to browse, showing job details like skills required, wage, duration, positions available, and shift timing. Filters out completed jobs and fully staffed positions.",
  "frontend/src/pages/JobTemplates.tsx": "Displays a list of saved job templates for employers, showing template details like required skills, experience, and salary range. Includes empty state with option to create first job and navigation to create new jobs from templates.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page with hero section, feature cards, and authentication flow that redirects authenticated users to appropriate dashboards based on their role (worker/employer). Displays platform benefits and call-to-action for Internet Identity login.",
  "frontend/src/pages/SubscriptionTiers.tsx": "Employer subscription management page displaying three tiers (Basic, Professional, Enterprise) with feature comparison table and pricing. Includes simulation mode banner indicating no actual payments are processed.",
  "frontend/src/pages/WorkerAvailability.tsx": "Worker availability management page with interactive calendar for setting weekly availability patterns. Allows workers to toggle availability for each day of the week and save changes to their profile.",
  "frontend/src/pages/WorkerDashboard.tsx": "Worker dashboard page displaying overview statistics (applications, available jobs, completed jobs, earnings), matching job recommendations based on worker skills, and recent job applications with navigation to job details.",
  "frontend/src/pages/WorkerNotifications.tsx": "Displays worker notifications for job assignments, reminders, confirmations, and cancellations with ability to mark notifications as read and view job details.",
  "frontend/src/pages/WorkerProfile.tsx": "Shows worker profile details including reliability score, rating, completed jobs, personal information, skills with experience levels, and a QR code for profile sharing with verification badge display.",
  "frontend/src/pages/WorkerRegistration.tsx": "Registration form for workers to create their profile by entering name, mobile number, selecting skills from predefined list, setting wage range, and providing location coordinates.",
  "frontend/src/pages/WorkerWallet.tsx": "Displays worker's payment history and earnings with total/pending balance cards, payment transaction list showing status and methods, and CSV export functionality with simulation disclaimer.",
  "frontend/src/pages/WorkHistory.tsx": "Worker analytics dashboard showing work history metrics including total days worked, on-time arrival percentage, early departures, job completion rate, and earnings by skill. Includes 90-day calendar heatmap visualization of work activity.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including HSL-based color system, spacing scale, typography, shadows, border radius variables, and accordion animations with tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state tracking document for an employment marketplace application, currently implementing Step 1 (Core Foundation) with worker registration, job posting, browsing, Internet Identity authentication, and role-based dashboards."
}