{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add worker verification badges, employer favorites, job templates, availability calendar, and job reminders",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Display worker verification badges on profiles and candidate lists with tier-based colors and job completion counts",
      "acceptanceCriteria": [
        "Badge component displays appropriate icon and color for each tier",
        "Badge shows on worker profile page near reliability score",
        "Badge appears in employer job candidate review lists",
        "Badge includes tooltip or label showing milestone achievement"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VerificationBadge.tsx",
          "operation": "create",
          "description": "Create VerificationBadge component that displays badge icon with tier-specific colors (bronze/copper, silver/gray, gold/yellow) based on BadgeLevel enum. Component accepts badgeLevel prop from VerifiedWorker type and completedJobs count. Renders badge image from frontend/public/assets/generated/badge-bronze.dim_128x128.png, badge-silver.dim_128x128.png, or badge-gold.dim_128x128.png with appropriate styling. Includes tooltip showing milestone achievement (10/50/100 jobs). Returns null if badgeLevel is 'none'."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetVerifiedWorker query hook that calls actor.getVerifiedWorker(workerId) to fetch verification badge data including badgeLevel and completedJobs count. Enable the query only when workerId is provided and actor is available."
        },
        {
          "path": "frontend/src/pages/WorkerProfile.tsx",
          "operation": "modify",
          "description": "Import and integrate VerificationBadge component to display worker verification status. Use useGetVerifiedWorker hook to fetch badge data for current worker. Position badge prominently near reliability score display. Show badge with completion count and tier information."
        },
        {
          "path": "frontend/src/pages/JobCandidates.tsx",
          "operation": "create",
          "description": "Create JobCandidates page for employers to review candidate matches for a specific job. Fetch job matches using useGetJobMatches hook. Display candidate cards showing worker information including verification badge using VerificationBadge component, reliability score, skills match percentage, and distance. Include actions to view full profile or assign worker to job. Use workerId from CandidateMatch to fetch badge data for each candidate."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for JobCandidates page at path '/employer/job/:jobId/candidates'. Wire route into employer section of router configuration."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Add favorites management interface showing favorited workers with quick actions for hiring and removal",
      "acceptanceCriteria": [
        "Dedicated favorites page or section accessible from employer dashboard",
        "Star/heart icon to add/remove workers from favorites in candidate lists",
        "Favorites list displays worker cards with key information",
        "Quick action buttons for hiring or removing favorites",
        "Visual indicator showing which workers are already favorited"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetEmployerFavoriteWorkers query hook calling actor.getEmployerFavoriteWorkers(employerId) to fetch array of favorited worker IDs. Add useAddFavoriteWorker and useRemoveFavoriteWorker mutation hooks calling actor.addFavoriteWorker and actor.removeFavoriteWorker with appropriate cache invalidation for employer favorites list."
        },
        {
          "path": "frontend/src/components/FavoriteToggle.tsx",
          "operation": "create",
          "description": "Create FavoriteToggle component rendering star/heart icon button to add or remove workers from favorites. Use frontend/public/assets/generated/icon-favorite.dim_64x64.png as icon asset. Accept workerId and isFavorited props. Use useAddFavoriteWorker and useRemoveFavoriteWorker mutations. Show filled icon when favorited, outlined when not. Include loading state during mutation."
        },
        {
          "path": "frontend/src/pages/EmployerFavorites.tsx",
          "operation": "create",
          "description": "Create EmployerFavorites page displaying list of favorited workers. Use useGetEmployerFavoriteWorkers to fetch favorite worker IDs, then fetch full worker profiles for each ID using useGetWorkerProfile. Display worker cards showing name, skills, reliability score, verification badge, and completed jobs count. Include FavoriteToggle component for removal and action buttons to view full profile or navigate to job assignment. Show empty state with icon-favorite.dim_64x64.png when no favorites exist."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for EmployerFavorites page at path '/employer/favorites'. Wire route into employer section of router configuration."
        },
        {
          "path": "frontend/src/pages/JobCandidates.tsx",
          "operation": "modify",
          "description": "Integrate FavoriteToggle component into candidate cards. Use useGetEmployerFavoriteWorkers hook to determine which candidates are favorited. Pass workerId and isFavorited status to FavoriteToggle. Position toggle button prominently on each candidate card."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add navigation link to favorites page in employer menu section. Use 'Favorites' label with heart icon indicator. Position between dashboard and job list links."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add job templates management interface for saving and reusing job posting configurations",
      "acceptanceCriteria": [
        "Save as template button on job creation form",
        "Templates library page showing all saved templates with preview",
        "Create from template action that pre-fills job posting form",
        "Template name editing and deletion options",
        "Visual confirmation when template is saved or used"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetJobTemplates query hook calling actor.getJobTemplates(employerId) to fetch array of JobTemplate objects. Add useSaveJobTemplate mutation hook calling actor.saveJobTemplate(template) with cache invalidation for templates list."
        },
        {
          "path": "frontend/src/pages/CreateJobPosting.tsx",
          "operation": "modify",
          "description": "Add 'Save as Template' button to job creation form. When clicked, show dialog prompting for template name. Use useSaveJobTemplate mutation to save current form values as JobTemplate including requiredSkills, wageAmount, duration, shiftTiming, workerCount, location, and jobDescription. Show success toast confirmation. Add 'Load from Template' button that opens template selection dialog. When template selected, pre-fill all form fields with template values."
        },
        {
          "path": "frontend/src/pages/JobTemplates.tsx",
          "operation": "create",
          "description": "Create JobTemplates page displaying library of saved templates. Use useGetJobTemplates hook to fetch templates for current employer. Display template cards showing templateName, preview of skills, wage, duration, and shift timing. Include frontend/public/assets/generated/icon-template.dim_64x64.png as template icon. Provide 'Use Template' button that navigates to job creation page with template data. Show empty state with icon-template.dim_64x64.png when no templates exist."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for JobTemplates page at path '/employer/templates'. Wire route into employer section of router configuration."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add navigation link to templates page in employer menu section. Use 'Job Templates' label with document icon. Position in job management section."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Build worker availability calendar interface with visual day/week/month views for managing availability",
      "acceptanceCriteria": [
        "Calendar view accessible from worker dashboard or profile",
        "Day, week, and month view toggles",
        "Click to toggle availability for specific dates",
        "Visual distinction between available, unavailable, and scheduled days",
        "Employers can view worker availability calendars when reviewing candidates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetWorkerAvailability query hook calling actor.getWorkerAvailability(workerId) to fetch array of DayAvailability objects for 7-day week pattern. Add useUpdateWorkerAvailabilityWithPattern mutation hook calling actor.updateWorkerAvailabilityWithPattern with workerId and availability array, invalidating worker availability queries on success."
        },
        {
          "path": "frontend/src/components/AvailabilityCalendar.tsx",
          "operation": "create",
          "description": "Create AvailabilityCalendar component displaying worker availability in calendar format. Use frontend/public/assets/generated/icon-calendar.dim_64x64.png for calendar header icon. Support week view showing 7-day pattern from DayAvailability array. For each day, render cell with visual indicators: green for available, red for unavailable, blue for scheduled jobs. Include click handlers to toggle availability when in edit mode. Accept workerId, editable boolean, and onUpdate callback props. Use useGetWorkerAvailability hook to fetch data. Display time ranges if specified in DayAvailability."
        },
        {
          "path": "frontend/src/pages/WorkerAvailability.tsx",
          "operation": "create",
          "description": "Create WorkerAvailability page for workers to manage their availability patterns. Display AvailabilityCalendar in editable mode. Include 'Save Changes' button that calls useUpdateWorkerAvailabilityWithPattern with updated availability array. Show icon-calendar.dim_64x64.png in header. Provide legend explaining color coding for available, unavailable, and scheduled days. Include instructions for setting weekly availability pattern."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for WorkerAvailability page at path '/worker/availability'. Wire route into worker section of router configuration."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add navigation link to availability page in worker menu section. Use 'My Availability' label with calendar icon. Position in worker dashboard section."
        },
        {
          "path": "frontend/src/pages/JobCandidates.tsx",
          "operation": "modify",
          "description": "Integrate AvailabilityCalendar component into candidate detail view in read-only mode. For each candidate, show mini availability calendar or expandable section with full calendar. Display availability status clearly to help employers make scheduling decisions. Use workerId from candidate to fetch and display their availability pattern."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Display worker availability calendars in employer candidate review interface for informed hiring decisions",
      "acceptanceCriteria": [
        "Mini calendar or availability indicator shown in candidate cards",
        "Expandable calendar view showing worker availability for job duration",
        "Availability status clearly marked (available/unavailable/partially available)",
        "Filtering option to show only workers available for job dates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AvailabilityIndicator.tsx",
          "operation": "create",
          "description": "Create AvailabilityIndicator component showing compact availability status for a worker. Display icon-calendar.dim_64x64.png with color-coded badge indicating overall availability (green for mostly available, yellow for partial, red for unavailable). Accept workerId prop and use useGetWorkerAvailability hook to calculate status. Include expandable section that renders full AvailabilityCalendar component when clicked. Use in candidate cards for quick availability assessment."
        },
        {
          "path": "frontend/src/pages/JobCandidates.tsx",
          "operation": "modify",
          "description": "Add AvailabilityIndicator component to each candidate card showing availability status at a glance. Include filter controls to show only candidates with specific availability status (available/unavailable/partial). Add sort option to prioritize candidates by availability match. Display availability prominently alongside reliability score and skills match."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Build in-app notification center displaying shift reminders, job confirmations, and alerts with unread badge",
      "acceptanceCriteria": [
        "Notification bell icon in navigation with unread count badge",
        "Dropdown or dedicated page showing notification list",
        "Notifications display message, timestamp, and read/unread status",
        "Click to mark notification as read",
        "Clear visual design distinguishing different notification types",
        "Reminders show for jobs starting within 24 hours"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetJobReminders query hook calling actor.getJobReminders(jobId) to fetch array of JobReminders objects. Since backend returns reminders per job, create a custom hook useGetWorkerNotifications that fetches reminders for all worker's assigned jobs and aggregates them into notification objects. Poll with refetchInterval for periodic updates."
        },
        {
          "path": "frontend/src/components/NotificationBell.tsx",
          "operation": "create",
          "description": "Create NotificationBell component rendering bell icon button with unread count badge. Use frontend/public/assets/generated/icon-notification.dim_64x64.png as bell icon. Fetch notifications using useGetWorkerNotifications hook. Calculate unread count from notifications array. Display badge with count when unread notifications exist. Include dropdown or click handler to open notification center. Position in navigation header for workers."
        },
        {
          "path": "frontend/src/components/NotificationList.tsx",
          "operation": "create",
          "description": "Create NotificationList component displaying list of notifications. Accept notifications array prop containing reminder data. For each notification, display message text, timestamp formatted as relative time, and read/unread visual indicator. Distinguish notification types (reminder for upcoming shift, job confirmation, update/cancellation) with different icons or colors. Show icon-notification.dim_64x64.png for header. Include 'Mark as Read' action using useUpdateJobReminders mutation. Sort by timestamp descending. Show empty state when no notifications."
        },
        {
          "path": "frontend/src/pages/WorkerNotifications.tsx",
          "operation": "create",
          "description": "Create WorkerNotifications dedicated page displaying full notification center. Use NotificationList component to show all notifications. Include filter tabs for all/unread/reminders/confirmations. Display icon-notification.dim_64x64.png in page header. Show notification count summary. Provide 'Mark All as Read' bulk action. Include refresh button to manually fetch latest notifications."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for WorkerNotifications page at path '/worker/notifications'. Wire route into worker section of router configuration."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Integrate NotificationBell component into navigation header for worker role. Position bell icon in header toolbar area near user profile or logout button. Ensure bell is visible on all worker pages. Add navigation link to full notifications page when bell is clicked or as menu item."
        },
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "create",
          "description": "Create WorkerDashboard page if it doesn't exist, or modify existing to include notifications summary widget. Display recent notifications (last 3-5) using NotificationList component. Show 'View All' link to WorkerNotifications page. Include quick stats about upcoming shifts and reminders. Position notifications prominently on dashboard."
        }
      ]
    }
  ]
}