{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend Implementation - Core Foundation for WorkConnect Employment Marketplace",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement worker registration form with essential fields including name, mobile, location coordinates, skills selection, experience years, and wage range",
      "acceptanceCriteria": [
        "Worker registration form captures name, mobile, location coordinates, skills, experience years, and wage range",
        "Form validation ensures all required fields are populated before submission",
        "Worker profile is stored in backend with unique identifier",
        "Successfully registered workers can view their profile data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkerRegistration.tsx",
          "operation": "modify",
          "description": "Enhance worker registration form to include all essential fields: full name input, mobile number input with validation, location coordinates input with geolocation button, multi-select skills picker using SkillsMultiSelect component, years of experience number input for each skill, and wage range inputs (min/max per day). Add form validation to ensure all required fields are filled. Wire form submission to createWorkerProfile mutation from useQueries hook. Add success state that redirects to worker profile page after successful registration. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/WorkerProfile.tsx",
          "operation": "modify",
          "description": "Enhance worker profile view to display all essential registration fields: name, mobile number, location coordinates, list of skills with experience levels using ExperienceLevelBadge component, years of experience per skill, and wage range (min-max display). Add loading and error states. Ensure profile data is fetched using getMyWorkerProfile query from useQueries hook."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement job posting form for employers with job title, description, required skills, wage, location, dates, and worker count",
      "acceptanceCriteria": [
        "Employer can create job posting with all specified fields",
        "Job posting form validates required fields and date logic (end date after start date)",
        "Created job postings are stored in backend with unique job ID",
        "Employer can view their posted jobs in a list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreateJobPosting.tsx",
          "operation": "modify",
          "description": "Update job posting form to ensure all required fields are present: job title input (use jobDescription field), detailed description textarea, required skills multi-select with experience levels using SkillsMultiSelect, wage per day number input, location coordinates with geolocation support, start date picker, end date picker, and number of positions input. Add validation for required fields, date logic (end date must be after start date), and positive numbers. Wire form to createJobPosting mutation. Add success redirect to employer job list page."
        },
        {
          "path": "frontend/src/pages/EmployerJobList.tsx",
          "operation": "modify",
          "description": "Ensure employer job list displays all posted jobs with key information: job title, description preview, required skills with badges, wage amount, location coordinates, date range, and worker count with assigned count. Add navigation to job details and candidate matching pages. Wire to getMyJobPostings query from useQueries hook."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement job browsing interface for workers with filters, search, and application functionality",
      "acceptanceCriteria": [
        "Workers can browse a list of all available job postings",
        "Job listings display key information: title, required skills, wage, location, and dates",
        "Workers can apply to jobs with a simple application action",
        "Application is recorded in backend linking worker ID to job ID",
        "Workers cannot apply to the same job multiple times"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/JobDiscovery.tsx",
          "operation": "modify",
          "description": "Enhance job discovery page to display all available job postings fetched from getAllJobPostings query. Show job cards with title (jobDescription), required skills with ExperienceLevelBadge components, wage per day, location coordinates, date range (calculated from duration), and available positions count. Add 'Apply' button that calls assignWorkerToJob mutation using the current worker's ID. Disable apply button if worker has already applied (check assignedWorkers array). Add filters for skills, wage range, and location proximity. Include search functionality for job descriptions."
        },
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "create",
          "description": "Create worker dashboard page showing overview of worker's activities. Display key metrics: total jobs applied to (count from assignedWorkers arrays where worker ID is present), available jobs count, completed jobs from profile, and reliability score using ReliabilityScoreBadge component. Show 'Available Jobs' section with job cards from JobDiscovery filtered to match worker skills. Show 'My Applications' section listing jobs where worker is assigned with application status. Include quick navigation links to job discovery, work history, profile, and availability pages. Wire to getMyWorkerProfile and getAllJobPostings queries."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Integrate Internet Identity authentication with user profile association and session persistence",
      "acceptanceCriteria": [
        "Users can authenticate using Internet Identity login",
        "Authentication state persists across browser sessions",
        "User profiles (worker or employer) are linked to authenticated principal",
        "Unauthenticated users are redirected to login when accessing protected routes",
        "Logout functionality clears authentication state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Enhance navigation to include authentication controls using useInternetIdentity hook. Display login button for unauthenticated users and logout button with user name for authenticated users. Show role-based menu items only after authentication: worker menu (Dashboard, Find Jobs, My Profile, Availability, Work History, Wallet, Notifications) and employer menu (Dashboard, Post Job, My Jobs, Analytics, Favorites, Templates, Subscriptions). Add admin menu items for admin users. Ensure logout clears React Query cache. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add authentication guards to protected routes using useInternetIdentity hook. Redirect unauthenticated users to landing page when accessing protected routes (all routes except landing page and role selection). After login, check if user has a profile using getCallerUserProfile query. If no profile exists, redirect to role selection page. After role selection, redirect to appropriate registration page. Once registered, redirect to role-specific dashboard."
        },
        {
          "path": "frontend/src/components/UserRoleSelector.tsx",
          "operation": "modify",
          "description": "Update role selector to integrate with authentication flow. Show after successful Internet Identity login if user has no profile (getCallerUserProfile returns null). Collect user name and role selection (worker or employer). Call saveCallerUserProfile mutation with name and selected role. After successful profile save, redirect to appropriate registration form: WorkerRegistration for worker role, EmployerRegistration for employer role. Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create landing page with hero section, value proposition, and clear CTAs for workers and employers",
      "acceptanceCriteria": [
        "Landing page displays hero section with platform description",
        "Clear navigation paths for workers and employers to get started",
        "Login button is prominently displayed for returning users",
        "Landing page is the default route for unauthenticated users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Enhance landing page with prominent hero section using generated hero banner image from frontend/public/assets/generated/hero-banner.dim_1200x400.png. Display WorkConnect platform title and value proposition: 'Connect skilled workers with employers efficiently and transparently'. Add two primary CTA buttons: 'Find Work' for workers and 'Hire Workers' for employers, both triggering Internet Identity login. Add prominent 'Login' button for returning users. Include features section highlighting platform benefits: easy registration, skill-based matching, secure payments, and reliability tracking. Use generated worker and employer icons (frontend/public/assets/generated/worker-icon.dim_128x128.png and frontend/public/assets/generated/employer-icon.dim_128x128.png) in features section. Add authentication check: if already authenticated and has profile, redirect to appropriate dashboard based on role."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement role selection flow directing new users to appropriate registration after authentication",
      "acceptanceCriteria": [
        "After first-time login, users see role selection interface",
        "User can select either Worker or Employer role",
        "Selected role is stored and associated with user's principal",
        "User is redirected to role-specific registration form after selection",
        "Role cannot be changed after initial selection without admin intervention"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure role selection route (/role-selection) is wired in the router configuration. Add route guard that shows UserRoleSelector component only for authenticated users without a profile. After role selection and profile save, redirect user to registration route based on role: /worker/register for workers, /employer/register for employers. Ensure existing users with profiles skip role selection and go directly to their dashboard."
        },
        {
          "path": "frontend/src/components/UserRoleSelector.tsx",
          "operation": "modify",
          "description": "Enhance role selector with two selection cards: 'I am a Worker' with worker icon (frontend/public/assets/generated/worker-icon.dim_128x128.png) and description 'Find jobs matching your skills and experience', and 'I am an Employer' with employer icon (frontend/public/assets/generated/employer-icon.dim_128x128.png) and description 'Post jobs and hire skilled workers'. Include name input field prominently. On selection and name entry, call saveCallerUserProfile with {name, role} and redirect to appropriate registration. Show loading state during profile save. Add validation to ensure name is provided before proceeding. Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create separate dashboard views for workers and employers showing relevant information and actions",
      "acceptanceCriteria": [
        "Worker dashboard displays list of available jobs matching their skills",
        "Worker dashboard shows jobs they have applied to with status",
        "Employer dashboard lists all jobs they have posted",
        "Employer dashboard shows number of applications per job",
        "Users are automatically routed to appropriate dashboard based on role"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "modify",
          "description": "Complete worker dashboard implementation with four main sections: (1) Overview metrics cards showing total applications count, available jobs matching skills, completed jobs, and reliability score with ReliabilityScoreBadge. (2) 'Recommended Jobs' section displaying job cards filtered by worker's skills from getAllJobPostings, showing job title, required skills with badges, wage, location, and quick apply button. (3) 'My Applications' section listing jobs where worker is in assignedWorkers array, showing application date, job details, and status (active/completed). (4) Quick actions panel with navigation to Find Jobs, Update Availability, View Work History, and View Wallet. Wire to getMyWorkerProfile and getAllJobPostings queries. Add loading and error states."
        },
        {
          "path": "frontend/src/pages/EmployerDashboard.tsx",
          "operation": "modify",
          "description": "Enhance employer dashboard to show key metrics: total jobs posted count, active jobs (not completed), total workers hired (sum of assignedWorkers across jobs), and average job fill rate. Add 'Recent Jobs' section displaying latest job postings with title, required skills, posted date, assigned workers count vs total needed, and navigation to view candidates. Include 'Recent Applications' activity feed showing latest worker assignments across all jobs. Add quick action buttons: Post New Job, View All Jobs, Bulk Upload, and View Analytics. Wire to getMyJobPostings query and ensure proper loading states."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add automatic dashboard routing based on user role. After authentication, fetch user profile using getCallerUserProfile. If role is 'worker', set default dashboard route to /worker/dashboard. If role is 'employer', set default dashboard route to /employer/dashboard. Ensure root route (/) redirects to appropriate dashboard for authenticated users with profiles, or to landing page for unauthenticated users. Wire WorkerDashboard to /worker/dashboard route."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add 'Dashboard' navigation link that routes to appropriate dashboard based on user role: /worker/dashboard for workers, /employer/dashboard for employers. Position Dashboard link as first menu item for authenticated users. Highlight active dashboard link in navigation. Ensure navigation shows role-specific menu items only: worker sees worker-related links, employer sees employer-related links."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply cohesive visual design theme with professional aesthetics suitable for employment marketplace",
      "acceptanceCriteria": [
        "Consistent color palette applied across all pages",
        "Typography hierarchy is clear and professional",
        "Layout patterns are cohesive throughout the application",
        "Visual design conveys trust and professionalism appropriate for employment context"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define professional employment marketplace color scheme using OKLCH color space. Set primary colors to trustworthy blues (#2563eb for primary, #1e40af for primary-dark) conveying reliability and professionalism. Use neutral grays for backgrounds and borders. Set accent colors to green (#10b981) for success states and positive actions. Configure muted tones for secondary content. Define destructive red (#ef4444) for warnings. Ensure sufficient contrast ratios for accessibility. Add custom utility classes for card shadows, hover states, and transitions used throughout the app."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind configuration with employment marketplace design tokens. Configure custom spacing scale for consistent layouts. Define typography scale with professional font sizes: headings (2xl, xl, lg) for hierarchy, body text (base, sm) for readability. Add custom border radius values for card components. Configure box shadows for depth: subtle shadows for cards, prominent shadows for modals. Set animation timings for smooth transitions. Ensure responsive breakpoints align with mobile-first approach."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Apply consistent layout styling with professional header using primary color background, white text, and proper spacing. Ensure main content area has adequate padding and max-width for readability. Style footer with muted background and organized link sections. Add consistent spacing between page sections. Apply subtle border separators. Ensure layout is responsive across mobile, tablet, and desktop viewports."
        }
      ]
    }
  ]
}